

#Область СобытияЭлементовФормыИСамойФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьПоляПроцента();
КонецПроцедуры   

&НаКлиенте
Процедура КатегорияСотрудниковПриИзменении(Элемент)
	УстановитьВидимостьПоляПроцента();
КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьВидимостьПоляПроцента()
	
	Элементы.ПроцентЗаВыполненныеРаботы.Видимость = 
	(Объект.Сотрудник.Категория = Перечисления.ВКМ_КатегорияСотрудника.Специалист); 
	
КонецПроцедуры



#КонецОбласти

