#language: ru

@tree

Функционал:Тестирвоание функционала закрытия заявки на обслуживание клиента от роли Специалиста

Как Специалист я хочу закрыть документ ОбслуживаниеКлиаента как будто я выполнил заявку. 
чтобы продемонстрировать этот функционал   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Закрытие документа ОбслуживаниеКлианта от лица специалиста (ВЫПОЛНЯТЬ после тестирования фичафайла TestDocManager)
И В командном интерфейсе я выбираю "ДобавленныеОбъекты" "Обслуживания клиентов"
Тогда открылось окно "Обслуживания клиентов"
И из выпадающего списка с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент4Значение' я выбираю точное значение "CпецовПЕ (Специалист 1)"
И в таблице 'Список' я активизирую поле с именем 'Клиент'
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *"
И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Обновление ККТ"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыПотраченоЧасов'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыПотраченоЧасов' я ввожу текст "1,0"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "1,00"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Подключение ККТ к 1С УНФ"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыПотраченоЧасов'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыПотраченоЧасов' я ввожу текст "2,0"
И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту'
И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "2,00"
И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд


