#language: ru

@tree

Функционал: тестирование обработки МассовоеСозданиеАктов

Как Бухгалтер я хочу
запустить обработку МассовоеСозданиеАктов 
чтобы протестировать и продемонстрировать данный функционал 
// Периоды вводить в Ванесса-Автомейшн вручную!!!
//Принцип работы обработки: 
//1. вы выбираете период за который нужно создать акты
//2. Выбрать последнюю дату месяца за который вы создаете акты -> нажимаем "Создать акты"
//3. Будет созданы договора контрагентов, по которым в данный мериод действует договор типа "Абонентское обслуживание"
// и суммы по этим договорам.
//4. Если в текущий месяц были выполнены и работы специалистов, то эти суммы тоже попадут в табл. части "УСЛУГИ" созданных актов 
//5. Если за текущий месяц по договору уэе была реализация - то новый создаваться не будет.
//6. По итогу в табличной части обработки появятся данные о новых АВР. Проверить в списке документов РеализацияТвоаровИУслуг

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Выполнение массового создания актов 
И В командном интерфейсе я выбираю "ДобавленныеОбъекты" "Массовое создание актов"
Тогда открылось окно "Массовое создание актов"
И я нажимаю кнопку выбора у поля с именем 'Период'
Тогда открылось окно "Выберите период"
И в поле с именем 'DateBegin' я ввожу текст "01.02.2024"
И я перехожу к следующему реквизиту
И в поле с именем 'DateEnd' я ввожу текст "29.02.2024"
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно "Массовое создание актов"
И в поле с именем 'ДатаАктов' я ввожу текст "29.02.2024"
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'СоздатьАкты'
И В командном интерфейсе я выбираю "Покупки и продажи" "Реализации товаров и услуг"




