
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;      
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища); 
	ПостроитьДиаграммуОтпусков(ТаблицаОтпусков);		
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
Процедура ПостроитьДиаграммуОтпусков(ТаблицаОтпусков) 
	
	Объект.Год = Формат(Объект.Год, "ДФ=yyyy");
	Объект.Год = Параметры.Год;
	Отпуска_ДГ.Очистить(); 
	
	// Строим Диаграмму Ганта по ТаблицаОтпусков
	ИмяСерии = "Отпуска на " + Формат(Число(Год(Объект.Год)),"ЧГ=0" ) + " год";
	Серия = Отпуска_ДГ.УстановитьСерию(ИмяСерии);
	Для каждого Запись из ТаблицаОтпусков Цикл
		Точка = Отпуска_ДГ.УстановитьТочку(Запись.Сотрудник);
		Значение = Отпуска_ДГ.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.КоличествоДней = Запись.КоличествоДней;
		Интервал = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала; 
		Интервал.Конец = Запись.ДатаОкончания;
	КонецЦикла;

КонецПроцедуры   
#КонецОбласти 

