#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры 

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	КоличествоДнейОтпуска();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура КоличествоДнейОтпуска() 
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Сотрудник) 
		И ЗначениеЗаполнено(ТекДанные.ДатаНачала) 
		И ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда  
		ТекДанные.КоличествоДней = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала) / 86400 + 1;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АнализГрафика(Команда)
	Адрес = АнализГрафикаНаСервере();       
	Если ЗначениеЗаполнено(Объект.Год) Тогда   
			
		СтруктураПараметры = Новый Структура("АдресХранилища, Год", Адрес, Объект.Год); 
		 
	Иначе ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран год отпусков");   
		
	КонецЕсли;
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", СтруктураПараметры);
КонецПроцедуры


&НаСервере
Функция АнализГрафикаНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	
КонецФункции  

#КонецОбласти
