#language: ru

@tree

Функционал: Создание 

Как МЕНЕДЖЕР я хочу провести планирование нескольких обслуживаний на специалистов 
чтобы проедмонстрировать этот процесс. Проводить тестирвоание на ДЕМО_БАЗЕ   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание документа ОбслуживаниеКлиентов от имени Менеджера (планирование работ для специалистов)
И В командном интерфейсе я выбираю "ДобавленныеОбъекты" "Обслуживания клиентов"
Тогда открылось окно "Обслуживания клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И из выпадающего списка с именем 'Клиент' я выбираю точное значение "Клиент 1"
И из выпадающего списка с именем 'Договор' я выбираю точное значение "Договор , аб.обслуж. Организация 1"
И из выпадающего списка с именем 'Специалист' я выбираю точное значение "Специалист 1"
И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "09.11.2024"
И в поле с именем 'ВремяНачалаРабот' я ввожу текст "12:00:00"
И в поле с именем 'ВремяОкончанияРабот' я ввожу текст "13:00:00"
И в поле с именем 'ОписаниеПроблемы' я ввожу текст 
	|'Обновление ПО ККТ'|
	|'Подключение ККТ к 1с УНФ'|
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента (создание) *" в течение 20 секунд
Тогда открылось окно "Обслуживания клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'Клиент'
Тогда открылось окно "Контрагенты"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000002" | "Клиент 2"     |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Договор'
Тогда открылось окно "Договоры контрагентов"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"                       |
	| "000000003" | "Договор , аб.обслуж. Организация 2" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Специалист'
Тогда открылось окно "Сотрудники"
И в таблице 'Список' я перехожу к строке:
	| "Код" | "Наименование" |
	| "002" | "Специалист 2" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "12.11.2024"
И в поле с именем 'ВремяНачалаРабот' я ввожу текст "10:00:00"
И в поле с именем 'ВремяОкончанияРабот' я ввожу текст "12:00:00"
И в поле с именем 'ОписаниеПроблемы' я ввожу текст "Обновление нетиповой конфигурации"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента (создание) *" в течение 20 секунд
