#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВыплатыСотрудникПриИзменении(Элемент)
	ТекДанные = Элементы.Выплаты.ТекущиеДанные;
	Текданные.Сумма = ЗаполнитьСумму(ТекДанные.Сотрудник);	
КонецПроцедуры


#КонецОбласти      



#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьСумму(Сотрудник)  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента, Сотрудник = &Сотрудник) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СуммаОстаток;
КонецФункции


#КонецОбласти

