
#Область ОбработчикиСобытийФормы  

&НаКлиенте
Процедура СоздатьАкты(Команда)  		
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
КонецПроцедуры

#КонецОбласти    


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Массовое создание актов";
	
	ВыполняемыйМетод = "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 

	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции 

&НаСервере
Функция НачатьВыполнениеНаСервере() 
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты", 
	Объект.Период, Объект.ДатаАктов);
КонецФункции


//   Обработка результата длительной операции "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты"
&НаСервере
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	РезультатФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	
	//Заполняем ТЧОбработки    	
	Элементы.СчетчикАВР.Заголовок = "";
	Если ЗначениеЗаполнено(РезультатФункции) Тогда	
		Сч = 0;   
		Объект.ТЧДоговораИАкты.Очистить();
		Для каждого Запись из РезультатФункции Цикл 
			НовСтрока = Объект.ТЧДоговораИАкты.Добавить(); 
			НовСтрока.Договор = Запись.Договор; 
			НовСтрока.АктВыполненныхРабот = Запись.Ссылка;
			Сч = Сч + 1;
		КонецЦикла;
		Элементы.СчетчикАВР.Заголовок ="За " + Формат(Объект.ДатаАктов,"ДЛФ=DD") + " количество актов составило " + Сч;  
	Иначе
		Элементы.СчетчикАВР.Заголовок ="За " + Формат(Объект.ДатаАктов,"ДЛФ=DD") + " не было ни одного акта";
	КонецЕсли;
	
	КонецПроцедуры

#КонецОбласти






































