#Область ВКМ_СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтобразитьВКМГруппаРеквизитов();
КонецПроцедуры
#КонецОбласти

#Область ВКМ_ПроцедурыИФункцииФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ОтобразитьВКМГруппаРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ВКМ_СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьВКМГруппаРеквизитов()
	Элементы.ВКМ_группа_реквизитов.Видимость = (Объект.ВидДоговора
		= Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);
КонецПроцедуры
#КонецОбласти