#Область ВКМ_ПроцедурыИФункцииФормы  

	&НаКлиенте
	Процедура ВидДоговораПриИзменении(Элемент) 
		 ОтобразитьВКМГруппаРеквизитов(); 
	КонецПроцедуры     

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)      
		ОтобразитьВКМГруппаРеквизитов();
	КонецПроцедуры

#КонецОбласти


#Область ВКМ_СлужебныеПроцедурыИФункции   

	&НаСервере
	Процедура ОтобразитьВКМГруппаРеквизитов()   
		Элементы.ВКМ_группа_реквизитов.Видимость = 
				(Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);			
	КонецПроцедуры

#КонецОбласти
	

